cmsis-svd/cmsis-svd/data/NXP/LPC11U6x.svd
				</field>
				<field>
					<name>VRANGE</name>
					<description>Reserved.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>HIGH_VOLTAGE</name>
							<description>High voltage. VDDA = 2.7 V to 3.6 V.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LOW_VOLTAGE</name>
							<description>Low voltage. VDDA = 1.8 V to 2.7 V.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:6]</bitRange>

				</field>
			</fields>
		</register>
	</registers>
</peripheral>

		<peripheral derivedFrom="I2C0">
			<name>I2C1</name>
			<description>I2C1</description>
			<baseAddress>0x40020000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>I2C1</name>
				<value>10</value>
			</interrupt>
		</peripheral>
		
		<peripheral>
			<name>RTC</name>
			<description>Real-Time Clock (RTC)</description>
			<groupName>RTC</groupName>
			<baseAddress>0x40024000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>RTC</name>
				<value>25</value>
			</interrupt>
			
			<registers>
				<register>
					<name>CTRL</name>
					<description>RTC control register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0xF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SWRESET</name>
							<description>Software reset control</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOT_IN_RESET</name>
									<description>Not in reset. The RTC is not held in reset. This bit must be cleared prior to configuring or initiating any operation of the RTC.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IN_RESET</name>
									<description>In reset. The RTC is held in reset.     All register bits within the RTC will be forced to their reset value except the OFD bit. This bit must be cleared before writing to any register in the RTC - including writes to set any of the other bits within this register.   Do not attempt to write to any bits of this register at the same time that the reset bit is being cleared. This bit may also serve as a Power Fail Detect flag for the always-on voltage domain.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OFD</name>
							<description>Oscillator fail detect status.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RUN</name>
									<description>Run. The RTC oscillator is running properly. Writing a 0 has no effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAIL</name>
									<description>Fail. RTC oscillator fail detected. Clear this flag after the following power-up. Writing a 1 clears this bit.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ALARM1HZ</name>
							<description>RTC 1 Hz timer alarm flag status.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_MATCH</name>
									<description>No match. No match has occurred on the 1 Hz RTC timer. Writing a 0 has no effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MATCH</name>
									<description>Match. A match condition has occurred on the 1 Hz RTC timer. This flag generates an RTC alarm interrupt request RTC_ALARM which can also wake up the part from any low power mode. Writing a 1 clears this bit.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKE1KHZ</name>
							<description>RTC 1 kHz timer wake-up flag status.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RUN</name>
									<description>Run. The RTC 1 kHz timer is running. Writing a 0 has no effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIME_OUT</name>
									<description>Time-out. The 1 kHz high-resolution/wake-up timer has timed out. This flag generates an RTC wake-up interrupt request RTC-WAKE which can also wake up the part from any low power mode. Writing a 1 clears this bit.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ALARMDPD_EN</name>
							<description>RTC 1 Hz timer alarm enable for Deep power-down.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable. A match on the 1 Hz RTC timer will not bring the part out of Deep power-down mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable. A match on the 1 Hz RTC timer bring the part out of Deep power-down mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKEDPD_EN</name>
							<description>RTC 1 kHz timer wake-up enable for Deep power-down.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable. A match on the 1 kHz RTC timer will not bring the part out of Deep power-down mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable. A match on the 1 kHz RTC timer bring the part out of Deep power-down mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTC1KHZ_EN</name>
							<description>RTC 1 kHz clock enable.  This bit can be set to 0 to conserve power if the 1 kHz timer is not used. This bit has no effect when the RTC is disabled (bit 7 of this register is 0).</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable. A match on the 1 kHz RTC timer will not bring the part out of Deep power-down mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable. The 1 kHz RTC timer is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTC_EN</name>
							<description>RTC enable.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable. The RTC 1 Hz and 1 kHz clocks are shut down and the RTC operation is disabled. This bit should be 0 when writing to load a value in the RTC counter register.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable. The 1 Hz RTC clock is running and RTC operation is enabled. You must set this bit to initiate operation of the RTC. The first clock to the RTC counter occurs 1 s after this bit is set. To also enable the high-resolution, 1 kHz clock, set bit 6 in this register.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
							
