cmsis-svd/cmsis-svd/data/NXP/LPC11U6x.svd
				</field>
				<field>
					<name>OD</name>
					<description>Open-drain mode.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled. Open-drain mode enabled.  This is not a true open-drain mode.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>S_MODE</name>
					<description>Digital filter sample mode.</description>
					<bitRange>[12:11]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>BYPASS_INPUT_FILTER</name>
							<description>Bypass input filter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>1_CLOCK_CYCLE</name>
							<description>1 clock cycle. Input pulses shorter than one filter clock are rejected.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>2_CLOCK_CYCLES</name>
							<description>2 clock cycles. Input pulses shorter than two filter clocks are rejected.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>3_CLOCK_CYCLES</name>
							<description>3 clock cycles. Input pulses shorter than three filter clocks are rejected.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CLKDIV</name>
					<description>Select peripheral clock divider for input filter sampling clock IOCONCLKDIV. Value 0x7 is reserved.</description>
					<bitRange>[15:13]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>IOCONCLKDIV0</name>
							<description>IOCONCLKDIV0. Use IOCON clock divider 0.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONCLKDIV1</name>
							<description>IOCONCLKDIV1. Use IOCON clock divider 1.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONCLKDIV2</name>
							<description>IOCONCLKDIV2 Use IOCON clock divider 2.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONCLKDIV3</name>
							<description>IOCONCLKDIV3. Use IOCON clock divider 3.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONCLKDIV4</name>
							<description>IOCONCLKDIV4. Use IOCON clock divider 4.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONCLKDIV5</name>
							<description>IOCONCLKDIV5. Use IOCON clock divider 5.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IOCONCLKDIV6</name>
							<description>IOCONCLKDIV6. Use IOCON clock divider 6.</description>
							<value>0x6</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
					
				</field>
			</fields>
		</register>
	</registers>
</peripheral>


		<peripheral>
	<name>SYSCON</name>
	<description>System configuration (SYSCON)</description>
	<groupName>SYSCON</groupName>
	<baseAddress>0x40048000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>BOD_WDT</name>
	<value>26</value>
	</interrupt>
	<registers>																			
	<register>																		
		<name>SYSMEMREMAP</name>																	
		<description>System memory remap</description>																	
		<addressOffset>0x000</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>MAP</name>															
				<description>System memory remap. Value 0x3 is reserved.</description>															
				<bitRange>[1:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>BOOT_LOADER_MODE</name>													
						<description>Boot Loader Mode. Interrupt vectors are re-mapped to Boot ROM.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>USER_RAM_MODE</name>													
						<description>User RAM Mode. Interrupt vectors are re-mapped to Static RAM.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>USER_FLASH_MODE</name>													
						<description>User Flash Mode. Interrupt vectors are not re-mapped and reside in Flash.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:2]</bitRange>															
														
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PRESETCTRL</name>																	
		<description>Peripheral reset control</description>																	
		<addressOffset>0x004</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>SSP0_RST_N</name>															
				<description>SSP0 reset control</description>															
				<bitRange>[0:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESET</name>													
						<description>Reset. Resets the SSP0 peripheral.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CLEAR_RESET</name>													
						<description>Clear reset. SSP0 reset de-asserted.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>I2C0_RST_N</name>															
				<description>I2C0 reset control</description>															
				<bitRange>[1:1]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESET</name>													
						<description>Reset. Resets the I2C0 peripheral.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CLEAR_RESET</name>													
						<description>Clear reset. I2C0 reset de-asserted.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>SSP1_RST_N</name>															
				<description>SSP1 reset control</description>															
				<bitRange>[2:2]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESET</name>													
						<description>Reset. Resets the SSP1 peripheral.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CLEAR_RESET</name>													
						<description>Clear reset. SSP1 reset de-asserted.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>I2C1_RST_N</name>															
				<description>I2C1 reset control</description>															
				<bitRange>[3:3]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESET</name>													
						<description>Reset. Resets the I2C1 peripheral.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CLEAR_RESET</name>													
						<description>Clear reset. I2C1 reset de-asserted.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>FRG_RST_N</name>															
				<description>FRG reset control</description>															
				<bitRange>[4:4]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESET</name>													
						<description>Reset. Resets the FRG peripheral.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CLEAR_RESET</name>													
						<description>Clear reset. FRG reset de-asserted.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>USART1_RST_N</name>															
				<description>USART1 reset control</description>															
				<bitRange>[5:5]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESET</name>													
						<description>Reset. Resets the USART1 peripheral.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CLEAR_RESET</name>													
						<description>Clear reset. USART1 reset de-asserted.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>USART2_RST_N</name>															
				<description>USART2 reset control</description>															
				<bitRange>[6:6]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESET</name>													
						<description>Reset. Resets the USART2 peripheral.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CLEAR_RESET</name>													
						<description>Clear reset. USART2 reset de-asserted.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>USART3_RST_N</name>															
				<description>USART3 reset control</description>															
				<bitRange>[7:7]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESET</name>													
						<description>Reset. Resets the USART3 peripheral.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CLEAR_RESET</name>													
						<description>Clear reset. USART3 reset de-asserted.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>USART4_RST_N</name>															
				<description>USART4 reset control</description>															
				<bitRange>[8:8]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESET</name>													
						<description>Reset. Resets the USART4 peripheral.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CLEAR_RESET</name>													
						<description>Clear reset. USART4 reset de-asserted.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>SCT0_RST_N</name>															
				<description>SCT0 reset control</description>															
				<bitRange>[9:9]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESET</name>													
						<description>Reset. Resets the SCT0 peripheral.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CLEAR_RESET</name>													
						<description>Clear reset. SCT0 reset de-asserted.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>SCT1_RST_N</name>															
				<description>SCT1 reset control</description>															
				<bitRange>[10:10]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESET</name>													
						<description>Reset. Resets the SCT1 peripheral.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CLEAR_RESET</name>													
						<description>Clear reset. SCT1 reset de-asserted.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:11]</bitRange>															
														
