cmsis-svd/cmsis-svd/data/NXP/LPC11U6x.svd
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>IRCCTRL</name>																	
		<description>IRC control</description>																	
		<addressOffset>0x028</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0x080</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>TRIM</name>															
				<description>Trim value</description>															
				<bitRange>[7:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:8]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>SYSRSTSTAT</name>																	
		<description>System reset status register</description>																	
		<addressOffset>0x030</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>POR</name>															
				<description>POR reset status</description>															
				<bitRange>[0:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>NO_POR_DETECTED</name>													
						<description>No POR detected</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>POR_DETECTED</name>													
						<description>POR detected</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>EXTRST</name>															
				<description>Status of the external RESET pin</description>															
				<bitRange>[1:1]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>NO_RESET_EVENT_DETEC</name>													
						<description>No reset event detected</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESET_DETECTED</name>													
						<description>Reset detected</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>WDT</name>															
				<description>Status of the Watchdog reset</description>															
				<bitRange>[2:2]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>NO_WDT_RESET_DETECTE</name>													
						<description>No WDT reset detected</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>WDT_RESET_DETECTED</name>													
						<description>WDT reset detected</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>BOD</name>															
				<description>Status of the Brown-out detect reset</description>															
				<bitRange>[3:3]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>NO_BOD_RESET_DETECTE</name>													
						<description>No BOD reset detected</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>BOD_RESET_DETECTED</name>													
						<description>BOD reset detected</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>SYSRST</name>															
				<description>Status of the software system reset</description>															
				<bitRange>[4:4]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>NO_SYSTEM_RESET_DETE</name>													
						<description>No System reset detected</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>SYSTEM_RESET_DETECTE</name>													
						<description>System reset detected</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:5]</bitRange>															
														
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>SYSPLLCLKSEL</name>																	
		<description>System PLL clock source select</description>																	
		<addressOffset>0x040</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>SEL</name>															
				<description>System PLL clock source</description>															
				<bitRange>[1:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>IRC</name>													
						<description>IRC</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>SYSTEM_OSCILLATOR</name>													
						<description>System oscillator. Crystal Oscillator (SYSOSC)</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>32_KHZ_CLOCK</name>													
						<description>32 kHz clock.Select this option when the 32 kHz clock is the clock source for the main clock and select the pll input in the MAINCLKSEL register. Do not use the 32 kHz clock with the PLL.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:2]</bitRange>															
														
