cmsis-svd/cmsis-svd/data/NXP/LPC11U6x.svd
			</field>																
			<field>																
				<name>SSP1</name>															
				<description>Enables clock for SSP1.</description>															
				<bitRange>[18:18]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLE</name>													
						<description>Disable</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLE</name>													
						<description>Enable</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PINT</name>															
				<description>Enables clock to GPIO Pin interrupt register interface.</description>															
				<bitRange>[19:19]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLE</name>													
						<description>Disable</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLE</name>													
						<description>Enable</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>USART1</name>															
				<description>Enables clock to USART1 register interface.</description>															
				<bitRange>[20:20]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLE</name>													
						<description>Disable</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLE</name>													
						<description>Enable</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>USART2</name>															
				<description>Enables clock to USART2 register interface.</description>															
				<bitRange>[21:21]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLE</name>													
						<description>Disable</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLE</name>													
						<description>Enable</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>USART3_4</name>															
				<description>Enables clock to USART3 and USART4 register interfaces.</description>															
				<bitRange>[22:22]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLE</name>													
						<description>Disable</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLE</name>													
						<description>Enable</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>GROUP0INT</name>															
				<description>Enables clock to GPIO GROUP0 interrupt register interface.</description>															
				<bitRange>[23:23]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLE</name>													
						<description>Disable</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLE</name>													
						<description>Enable</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>GROUP1INT</name>															
				<description>Enables clock to GPIO GROUP1 interrupt register interface.</description>															
				<bitRange>[24:24]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLE</name>													
						<description>Disable</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLE</name>													
						<description>Enable</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>I2C1</name>															
				<description>Enables clock for I2C1.</description>															
				<bitRange>[25:25]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLE</name>													
						<description>Disable</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLE</name>													
						<description>Enable</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RAM1</name>															
				<description>Enables clock for SRAM1 located at 0x2000 0000 to 0x2000 0800.</description>															
				<bitRange>[26:26]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLE</name>													
						<description>Disable</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLE</name>													
						<description>Enable</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>USBSRAM</name>															
				<description>Enables USB SRAM/SRAM2 block located at 0x2000 4000 to 0x2000 4800.</description>															
				<bitRange>[27:27]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLE</name>													
						<description>Disable</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLE</name>													
						<description>Enable</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>CRC</name>															
				<description>Enables clock for CRC.</description>															
				<bitRange>[28:28]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLE</name>													
						<description>Disable</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLE</name>													
						<description>Enable</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>DMA</name>															
				<description>Enables clock for DMA.</description>															
				<bitRange>[29:29]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLE</name>													
						<description>Disable</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLE</name>													
						<description>Enable</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RTC</name>															
				<description>Enables clock for RTC register interface.</description>															
				<bitRange>[30:30]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLE</name>													
						<description>Disable</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLE</name>													
						<description>Enable</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>SCT0_1</name>															
				<description>Enables clock for SCT0 and SCT1.</description>															
				<bitRange>[31:31]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLE</name>													
						<description>Disable</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLE</name>													
						<description>Enable</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>SSP0CLKDIV</name>																	
		<description>SSP0 clock divider</description>																	
		<addressOffset>0x094</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>DIV</name>															
				<description>SPI0_PCLK clock divider values.  0: System clock disabled.  1: Divide by 1.  to 255: Divide by 255.</description>															
				<bitRange>[7:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:8]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>USART0CLKDIV</name>																	
		<description>USART0 clock divider</description>																	
		<addressOffset>0x098</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>DIV</name>															
				<description>UART_PCLK clock divider values  0: Disable UART_PCLK.  1: Divide by 1.  to 255: Divide by 255.</description>															
				<bitRange>[7:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:8]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>SSP1CLKDIV</name>																	
		<description>SSP1 clock divider</description>																	
		<addressOffset>0x09C</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0x0000</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>DIV</name>															
				<description>SSP1_PCLK clock divider values  0: Disable SSP1_PCLK.  1: Divide by 1.  to 255: Divide by 255.</description>															
				<bitRange>[7:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:8]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>FRGCLKDIV</name>																	
		<description>Clock divider for the common fractional baud rate generator of USART1, USART2, USART3, USART4</description>																	
		<addressOffset>0x0A0</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>DIV</name>															
				<description>USART fractional baud rate generator clock divider values.  0: Clock disabled.  1: Divide by 1. to 255: Divide by 255.</description>															
				<bitRange>[7:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:8]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>USBCLKSEL</name>																	
		<description>USB clock source select</description>																	
		<addressOffset>0x0C0</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>SEL</name>															
				<description>USB clock source. Values 0x2 and 0x3 are reserved.</description>															
				<bitRange>[1:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>USB_PLL_OUT</name>													
						<description>USB PLL out</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>MAIN_CLOCK</name>													
						<description>Main clock</description>													
						<value>0x1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:2]</bitRange>															
														
