cmsis-svd/cmsis-svd/data/NXP/LPC11U6x.svd
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>USBCLKUEN</name>																	
		<description>USB clock source update enable</description>																	
		<addressOffset>0x0C4</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>ENA</name>															
				<description>Enable USB clock source update</description>															
				<bitRange>[0:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>NO_CHANGE</name>													
						<description>No change</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>UPDATE_CLOCK_SOURCE</name>													
						<description>Update clock source</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:1]</bitRange>															
														
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>USBCLKDIV</name>																	
		<description>USB clock source divider</description>																	
		<addressOffset>0x0C8</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>DIV</name>															
				<description>USB clock divider values  0: Disable USB clock.  1: Divide by 1. to 255: Divide by 255.</description>															
				<bitRange>[7:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:8]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>CLKOUTSEL</name>																	
		<description>CLKOUT clock source select</description>																	
		<addressOffset>0x0E0</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>SEL</name>															
				<description>CLKOUT clock source</description>															
				<bitRange>[1:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>IRC_OSCILLATOR</name>													
						<description>IRC oscillator</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CRYSTAL_OSCILLATOR</name>													
						<description>Crystal oscillator (SYSOSC)</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>WATCHDOG_OSCILLATOR</name>													
						<description>Watchdog oscillator</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>MAIN_CLOCK</name>													
						<description>Main clock</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:2]</bitRange>															
														
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>CLKOUTUEN</name>																	
		<description>CLKOUT clock source update enable</description>																	
		<addressOffset>0x0E4</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>ENA</name>															
				<description>Enable CLKOUT clock source update</description>															
				<bitRange>[0:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>NO_CHANGE</name>													
						<description>No change</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>UPDATE_CLOCK_SOURCE</name>													
						<description>Update clock source</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:1]</bitRange>															
														
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>CLKOUTDIV</name>																	
		<description>CLKOUT clock divider</description>																	
		<addressOffset>0x0E8</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>DIV</name>															
				<description>CLKOUT clock divider values  0: Disable CLKOUT clock divider.  1: Divide by 1. to 255: Divide by 255.</description>															
				<bitRange>[7:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:8]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>UARTFRGDIV</name>																	
		<description>USART fractional generator divider value</description>																	
		<addressOffset>0x0F0</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>DIV</name>															
				<description>Denominator of the fractional divider. DIV is equal to the programmed value +1. Always set to 0xFF to use with the fractional baud rate generator.</description>															
				<bitRange>[7:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:8]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>UARTFRGMULT</name>																	
		<description>USART fractional generator multiplier value</description>																	
		<addressOffset>0x0F4</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>MULT</name>															
				<description>Numerator of the fractional divider. MULT is equal to the programmed value.</description>															
				<bitRange>[7:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:8]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>EXTTRACECMD</name>																	
		<description>External trace buffer command register</description>																	
		<addressOffset>0x0FC</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>START</name>															
				<description>Trace start command. Writing a one to this bit sets the TSTART signal to the MTB to HIGH and starts tracing if the TSTARTEN bit in the MTB master register is set to one as well.</description>															
				<bitRange>[0:0]</bitRange>															
			</field>																
			<field>																
				<name>STOP</name>															
				<description>Trace stop command. Writing a one to this bit sets the TSTOP signal in the MTB to HIGH and stops tracing if the TSTOPEN bit in the MTB master register is set to one as well.</description>															
				<bitRange>[1:1]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:2]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PIOPORCAP0</name>																	
		<description>POR captured PIO status 0</description>																	
		<addressOffset>0x100</addressOffset>																	
		<access>read-only</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0x00000000</resetMask>																	
		<fields>																	
			<field>																
				<name>PIOSTAT</name>															
				<description>State of PIO0_23 through PIO0_0 at power-on reset</description>															
				<bitRange>[23:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:24]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PIOPORCAP1</name>																	
		<description>POR captured PIO status 1</description>																	
		<addressOffset>0x104</addressOffset>																	
		<access>read-only</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0x00000000</resetMask>																	
		<fields>																	
			<field>																
				<name>PIOSTAT</name>															
				<description>State of PIO1_31 through PIO1_0 at power-on reset</description>															
				<bitRange>[31:0]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PIOPORCAP2</name>																	
		<description>POR captured PIO status 1</description>																	
		<addressOffset>0x108</addressOffset>																	
		<access>read-only</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0x00000000</resetMask>																	
		<fields>																	
			<field>																
				<name>PIOSTAT</name>															
				<description>State of PIO2_23 through PIO2_0 at power-on reset</description>															
				<bitRange>[23:0]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>IOCONCLKDIV6</name>																	
		<description>Peripheral clock  to the IOCON block for programmable glitch filter</description>																	
		<addressOffset>0x134</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0x00000000</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>DIV</name>															
				<description>IOCON glitch filter clock divider values 0: Disable IOCONFILTR_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>															
				<bitRange>[7:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:8]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>IOCONCLKDIV5</name>																	
		<description>Peripheral clock  to the IOCON block for programmable glitch filter</description>																	
		<addressOffset>0x138</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0x00000000</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>DIV</name>															
				<description>IOCON glitch filter clock divider values 0: Disable IOCONFILTR_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>															
				<bitRange>[7:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:8]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>IOCONCLKDIV4</name>																	
		<description>Peripheral clock  to the IOCON block for programmable glitch filter</description>																	
		<addressOffset>0x13C</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0x00000000</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>DIV</name>															
				<description>IOCON glitch filter clock divider values 0: Disable IOCONFILTR_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>															
				<bitRange>[7:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:8]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>IOCONCLKDIV3</name>																	
		<description>Peripheral clock  to the IOCON block for programmable glitch filter</description>																	
		<addressOffset>0x140</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0x00000000</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>DIV</name>															
				<description>IOCON glitch filter clock divider values 0: Disable IOCONFILTR_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>															
				<bitRange>[7:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:8]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>IOCONCLKDIV2</name>																	
		<description>Peripheral clock  to the IOCON block for programmable glitch filter</description>																	
		<addressOffset>0x144</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0x00000000</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>DIV</name>															
				<description>IOCON glitch filter clock divider values 0: Disable IOCONFILTR_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>															
				<bitRange>[7:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:8]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>IOCONCLKDIV1</name>																	
		<description>Peripheral clock  to the IOCON block for programmable glitch filter</description>																	
		<addressOffset>0x148</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0x00000000</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>DIV</name>															
				<description>IOCON glitch filter clock divider values 0: Disable IOCONFILTR_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>															
				<bitRange>[7:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:8]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>IOCONCLKDIV0</name>																	
		<description>Peripheral clock  to the IOCON block for programmable glitch filter</description>																	
		<addressOffset>0x14C</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0x00000000</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>DIV</name>															
				<description>IOCON glitch filter clock divider values 0: Disable IOCONFILTR_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>															
				<bitRange>[7:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:8]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>BODCTRL</name>																	
		<description>Brown-Out Detect</description>																	
		<addressOffset>0x150</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>BODRSTLEV</name>															
				<description>BOD reset level</description>															
				<bitRange>[1:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>LEVEL_0</name>													
						<description>Level 0.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>LEVEL_1</name>													
						<description>Level 1.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>LEVEL_2</name>													
						<description>Level 2.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>LEVEL_3</name>													
						<description>Level 3.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>BODINTVAL</name>															
				<description>BOD interrupt level</description>															
				<bitRange>[3:2]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>LEVEL_2</name>													
						<description>Level 2.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>LEVEL_3</name>													
						<description>Level 3.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>BODRSTENA</name>															
				<description>BOD reset enable</description>															
				<bitRange>[4:4]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLE_RESET_FUNCTI</name>													
						<description>Disable reset function.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLE_RESET_FUNCTIO</name>													
						<description>Enable reset function.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:5]</bitRange>															
														
