cmsis-svd/cmsis-svd/data/NXP/LPC11U6x.svd
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>SYSTCKCAL</name>																	
		<description>System tick counter calibration</description>																	
		<addressOffset>0x154</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0x00000000</resetMask>																	
		<fields>																	
			<field>																
				<name>CAL</name>															
				<description>System tick timer calibration value</description>															
				<bitRange>[25:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:26]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>IRQLATENCY</name>																	
		<description>IRQ delay. Allows trade-off between interrupt latency and determinism.</description>																	
		<addressOffset>0x170</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0x00000010</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>LATENCY</name>															
				<description>8-bit latency value</description>															
				<bitRange>[7:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:8]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>NMISRC</name>																	
		<description>NMI Source Control</description>																	
		<addressOffset>0x174</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>IRQN</name>															
				<description>The IRQ number of the interrupt that acts as the Non-Maskable Interrupt (NMI) if bit 31 is 1. See Table 6 for the list of interrupt sources and their IRQ numbers.</description>															
				<bitRange>[4:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[30:5]</bitRange>															
			</field>																
			<field>																
				<name>NMIEN</name>															
				<description>Write a 1 to this bit to enable the Non-Maskable Interrupt (NMI) source selected by bits 4:0.</description>															
				<bitRange>[31:31]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<dim>8</dim>																	
		<dimIncrement>0x4</dimIncrement>																	
		<dimIndex>0-7</dimIndex>																	
		<name>PINTSEL%s</name>																	
		<description>GPIO Pin Interrupt Select register 0</description>																	
		<addressOffset>0x178</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>INTPIN</name>															
				<description>Pin number. PIO0_0 = 0, ..., PIO0_23 = 23, PIO1_0 = 24, ..., PIO1_31 = 55, PIO2_0 = 56, ..., PIO2_7 = 63.</description>															
				<bitRange>[5:0]</bitRange>															
														
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:6]</bitRange>															
																		
																		
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>USBCLKCTRL</name>																	
		<description>USB clock control</description>																	
		<addressOffset>0x198</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0x00000000</resetMask>																	
		<fields>																	
			<field>																
				<name>AP_CLK</name>															
				<description>USB need_clock signal control</description>															
				<bitRange>[0:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>HARDWARE</name>													
						<description>Hardware. Under hardware control.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>FORCED</name>													
						<description>Forced. Forced HIGH.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>POL_CLK</name>															
				<description>USB need_clock polarity for triggering the USB wake-up interrupt</description>															
				<bitRange>[1:1]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>FALLING_EDGE</name>													
						<description>Falling edge. Falling edge of the USB need_clock triggers the USB wake-up (default).</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RISING_EDGE</name>													
						<description>Rising edge. Rising edge of the USB need_clock triggers the USB wake-up.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved. Only write 0 to this bit.</description>															
				<bitRange>[2:2]</bitRange>															
														
