cmsis-svd/cmsis-svd/data/NXP/LPC11U6x.svd
			</field>																
			<field>																
				<name>USBPAD_PD</name>															
				<description>USB transceiver power-down configuration</description>															
				<bitRange>[10:10]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>POWERED</name>													
						<description>Powered</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>POWERED_DOWN</name>													
						<description>Powered down</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved. This bit must be set to one in Run mode.</description>															
				<bitRange>[11:11]</bitRange>															
																			
															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[12:12]</bitRange>															
																			
															
			</field>																
			<field>																
				<name>TEMPSENSE_PD</name>															
				<description>Temperature sensor wake-up configuration</description>															
				<bitRange>[13:13]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>POWERED</name>													
						<description>Powered</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>POWERED_DOWN</name>													
						<description>Powered down</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved. Always write these bits as 0b11.</description>															
				<bitRange>[15:14]</bitRange>															
																			
															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:16]</bitRange>															
																			
															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>DEVICE_ID</name>																	
		<description>Device ID</description>																	
		<addressOffset>0x3F4</addressOffset>																	
		<access>read-only</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0x00000000</resetMask>																	
		<fields>																	
			<field>																
				<name>DEVICEID</name>															
				<description>PARTID</description>															
				<bitRange>[31:0]</bitRange>															
																			
			</field>																
		</fields>																	
	</register>																		
																			
																			
</registers>																			

																						

		</peripheral>
		
		

		
		<peripheral>
	<name>USART4</name>
	<description>USART4 </description>
	<groupName>USART4</groupName>
	<baseAddress>0x4004C000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>USART1_4</name>
	<value>11</value>
	</interrupt>
	<registers>												
	<register>											
		<name>CFG</name>										
		<description>USART Configuration register. Basic USART configuration settings that typically are not changed during operation.</description>										
		<addressOffset>0x000</addressOffset>										
		<access>read-write</access>										
		<resetValue>0</resetValue>										
		<resetMask>0xFFFFFFFF</resetMask>										
		<fields>										
			<field>									
				<name>ENABLE</name>								
				<description>USART Enable.</description>								
				<bitRange>[0:0]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>DISABLED</name>						
						<description>Disabled. The USART is disabled and the internal state machine and counters are reset. While Enable = 0, all USART interrupts and DMA transfers are disabled. When Enable is set again, CFG and most other control bits remain unchanged. For instance, when re-enabled, the USART will immediately generate a TxRdy interrupt (if  enabled in the INTENSET register) or a DMA transfer request because the transmitter has been reset and is therefore available.</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>ENABLED</name>						
						<description>Enabled. The USART is enabled for operation.</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved. Read value is undefined, only zero should be written.</description>								
				<bitRange>[1:1]</bitRange>								
							
			</field>									
			<field>									
				<name>DATALEN</name>								
				<description>Selects the data size for the USART.</description>								
				<bitRange>[3:2]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>7_BIT_DATA_LENGTH</name>						
						<description>7 bit Data length.</description>						
						<value>0x0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>8_BIT_DATA_LENGTH</name>						
						<description>8 bit Data length.</description>						
						<value>0x1</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>9_BIT_DATA_LENGTH</name>						
						<description>9 bit data length. The 9th bit is commonly used for addressing in multidrop mode. See the ADDRDET bit in the CTL register.</description>						
						<value>0x2</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>RESERVED</name>						
						<description>Reserved.</description>						
						<value>0x3</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>PARITYSEL</name>								
				<description>Selects what type of parity is used by the USART.</description>								
				<bitRange>[5:4]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>NO_PARITY</name>						
						<description>No parity.</description>						
						<value>0x0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>RESERVED</name>						
						<description>Reserved.</description>						
						<value>0x1</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>EVEN_PARITY</name>						
						<description>Even parity. Adds a bit to each character such that the number of 1s in a transmitted character is even, and the number of 1s in a received character is expected to be even.</description>						
						<value>0x2</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>ODD_PARITY</name>						
						<description>Odd parity. Adds a bit to each character such that the number of 1s in a transmitted character is odd, and the number of 1s in a received character is expected to be odd.</description>						
						<value>0x3</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>STOPLEN</name>								
				<description>Number of stop bits appended to transmitted data. Only a single stop bit is required for received data.</description>								
				<bitRange>[6:6]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>1_STOP_BIT</name>						
						<description>1 stop bit.</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>2_STOP_BITS</name>						
						<description>2 stop bits. This setting should only be used for asynchronous communication.</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>MODE32K</name>								
				<description>Selects standard or 32 kHz clocking mode.</description>								
				<bitRange>[7:7]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>STANDARD</name>						
						<description>UART uses standard clocking.</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>32KHZ</name>						
						<description>UART uses the 32 kHz clock from the RTC oscillator as the clock source to the BRG, and uses a special bit clocking scheme.</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved. Read value is undefined, only zero should be written.</description>								
				<bitRange>[8:8]</bitRange>								
							
