cmsis-svd/cmsis-svd/data/NXP/LPC11U6x.svd
						</field>
					</fields>
				</register>
				<register>																						
					<dim>3</dim>																					
					<dimIncrement>0x4</dimIncrement>																					
					<dimIndex>0-2</dimIndex>																					
					<name>PORT_POL[%s]</name>
					<displayName>PORT_POL[%s]</displayName>
					<description>GPIO grouped interrupt port 0 polarity register</description>																					
					<addressOffset>0x020</addressOffset>																					
					<access>read-write</access>																					
					<resetValue>0xFFFFFFFF</resetValue>																					
					<resetMask>0xFFFFFFFF</resetMask>																					
					<fields>																					
						<field>																				
							<name>POL0</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[0:0]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL1</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[1:1]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL2</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[2:2]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL3</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[3:3]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL4</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[4:4]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL5</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[5:5]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL6</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[6:6]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL7</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[7:7]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL8</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[8:8]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL9</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[9:9]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL10</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[10:10]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL11</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[11:11]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL12</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[12:12]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL13</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[13:13]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL14</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[14:14]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL15</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[15:15]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL16</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[16:16]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL17</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[17:17]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL18</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[18:18]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL19</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[19:19]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL20</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[20:20]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL21</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[21:21]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL22</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[22:22]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL23</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[23:23]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL24</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[24:24]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL25</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[25:25]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL26</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[26:26]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL27</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[27:27]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL28</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[28:28]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL29</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[29:29]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL30</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[30:30]</bitRange>																			
						</field>																				
						<field>																				
							<name>POL31</name>																			
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>																			
							<bitRange>[31:31]</bitRange>																			
						</field>																				
					</fields>																					
				</register>
