cmsis-svd/cmsis-svd/data/NXP/LPC11U6x.svd
			</registers>
		</peripheral>

		<peripheral derivedFrom="GINT0">
			<name>GINT1</name>
			<description>GINT1</description>
			<baseAddress>0x40060000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>GINT1</name>
				<value>9</value>
			</interrupt>
		</peripheral>
		
		
		

		
		
		


		
		
		
		
		<peripheral derivedFrom="USART4">
			<name>USART1</name>
			<description>USART1</description>
			<baseAddress>0x4006C000</baseAddress>
		   
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
						
		</peripheral>
		<peripheral derivedFrom="USART4">
			<name>USART2</name>
			<description>USART2</description>
			<baseAddress>0x40070000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>USART2_3</name>
				<value>12</value>
			</interrupt>
		</peripheral>
		<peripheral derivedFrom="USART4">
			<name>USART3</name>
			<description>USART3</description>
			<baseAddress>0x40074000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
		
		</peripheral>
		<peripheral>
	<name>USB</name>
	<description>USB device controller</description>
	<groupName>USB</groupName>
	<baseAddress>0x40080000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>USB</name>
	<value>22</value>
	</interrupt>
	<interrupt>
	<name>USB_FIQ</name>
	<value>23</value>
	</interrupt>
			<interrupt>
				<name>USBWAKEUP</name>
				<value>30</value>
			</interrupt>
	<registers>
		<register>
			<name>DEVCMDSTAT</name>
			<description>USB Device Command/Status register</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000800</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DEV_ADDR</name>
					<description>USB device address. After bus reset, the address is reset to 0x00. If the enable bit is set, the device will respond on packets for function address DEV_ADDR. When receiving a SetAddress Control Request from the USB host, software must program the new address before completing the status phase of the SetAddress Control Request.</description>
					<bitRange>[6:0]</bitRange>

				</field>
				<field>
					<name>DEV_EN</name>
					<description>USB device enable. If this bit is set, the HW will start responding on packets for function address DEV_ADDR.</description>
					<bitRange>[7:7]</bitRange>

				</field>
				<field>
					<name>SETUP</name>
					<description>SETUP token received. If a SETUP token is received and acknowledged by the device, this bit is set. As long as this bit is set all received IN and OUT tokens will be NAKed by HW. SW must clear this bit by writing a one. If this bit is zero, HW will handle the tokens to the CTRL EP0 as indicated by the CTRL EP0 IN and OUT data information programmed by SW.</description>
					<bitRange>[8:8]</bitRange>

				</field>
				<field>
					<name>PLL_ON</name>
					<description>USB Clock/PLL control.</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>USB_NEEDCLK_FUNCTION</name>
							<description>USB_NeedClk functional</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USB_NEEDCLK_ALWAYS_1</name>
							<description>USB_NeedClk always 1. Clock will not be stopped in case of suspend.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[10:10]</bitRange>

				</field>
				<field>
					<name>LPM_SUP</name>
					<description>LPM Support.</description>
					<bitRange>[11:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LPM_NOT_SUPPORTED</name>
							<description>LPM not supported.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LPM_SUPPORTED</name>
							<description>LPM supported.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INTONNAK_AO</name>
					<description>Interrupt on NAK for interrupt and bulk OUT EP</description>
					<bitRange>[12:12]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ONLY_ACKNOWLEDGED_PA</name>
							<description>Only acknowledged packets generate an interrupt</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BOTH_ACKNOWLEDGED_AN</name>
							<description>Both acknowledged and NAKed packets generate interrupts.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INTONNAK_AI</name>
					<description>Interrupt on NAK for interrupt and bulk IN EP</description>
					<bitRange>[13:13]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ONLY_ACKNOWLEDGED_PA</name>
							<description>Only acknowledged packets generate an interrupt</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BOTH_ACKNOWLEDGED_AN</name>
							<description>Both acknowledged and NAKed packets generate interrupts.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INTONNAK_CO</name>
					<description>Interrupt on NAK for control OUT EP</description>
					<bitRange>[14:14]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ONLY_ACKNOWLEDGED_PA</name>
							<description>Only acknowledged packets generate an interrupt</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BOTH_ACKNOWLEDGED_AN</name>
							<description>Both acknowledged and NAKed packets generate interrupts.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INTONNAK_CI</name>
					<description>Interrupt on NAK for control IN EP</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ONLY_ACKNOWLEDGED_PA</name>
							<description>Only acknowledged packets generate an interrupt</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BOTH_ACKNOWLEDGED_AN</name>
							<description>Both acknowledged and NAKed packets generate interrupts.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DCON</name>
					<description>Device status - connect.  The connect bit must be set by SW to indicate that the device must signal a connect. The pull-up resistor on USB_DP will be enabled when this bit is set and the VbusDebounced bit is one.</description>
					<bitRange>[16:16]</bitRange>

