cmsis-svd/cmsis-svd/data/NXP/LPC11U6x.svd
				</field>
			</fields>
		</register>
		<register>
			<dim>16</dim>
			<dimIncrement>0x10</dimIncrement>
			<dimIndex>0-15</dimIndex>
			<name>CTLSTAT%s</name>
			<description>Control and status register for DMA channel 0.</description>
			<addressOffset>0x404</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>VALIDPENDING</name>
					<description>Valid pending flag for this channel. This bit is set when a 1 is written to the corresponding bit in the related SETVALID register when CFGVALID = 1 for the same channel.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_EFFECT_ON_DMA_OPE</name>
							<description>No effect on DMA operation.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>VALID_PENDING</name>
							<description>Valid pending.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[1:1]</bitRange>

				</field>
				<field>
					<name>TRIG</name>
					<description>Trigger flag. Indicates that the trigger for this channel is currently set. This bit is cleared at the end of an entire transfer or upon reload when CLRTRIG = 1.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_TRIGGERED</name>
							<description>Not triggered. The trigger for this DMA channel is not set. DMA operations will not be carried out.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TRIGGERED</name>
							<description>Triggered. The trigger for this DMA channel is set. DMA operations will be carried out.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:3]</bitRange>
					
				</field>
			</fields>
		</register>
		<register>
			<dim>16</dim>
			<dimIncrement>0x10</dimIncrement>
			<dimIndex>0-15</dimIndex>
			<name>XFERCFG%s</name>
			<description>Transfer configuration register for DMA channel 0.</description>
			<addressOffset>0x408</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>CFGVALID</name>
					<description>Configuration Valid flag. This bit indicates whether the current channel descriptor is valid and can potentially be acted upon, if all other activation criteria are fulfilled.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_VALID</name>
							<description>Not valid. The current channel descriptor is not considered valid.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>VALID</name>
							<description>Valid. The current channel descriptor is considered valid.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RELOAD</name>
					<description>Indicates whether the channel's control structure will be reloaded when the current descriptor is exhausted. Reloading allows ping-pong and linked transfers.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled. Do not reload the channels' control structure when the current descriptor is exhausted.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled. Reload the channels' control structure when the current descriptor is exhausted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SWTRIG</name>
					<description>Software Trigger.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>WHEN_WRITTEN_BY_SOFT</name>
							<description>When written by software, the trigger for this channel is not set. A new trigger, as defined by the HWTRIGEN, TRIGPOL, and TRIGTYPE will be needed to start the channel.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WHEN_WRITTEN_BY_SOFT</name>
							<description>When written by software, the trigger for this channel is set immediately. This feature should not be used with level triggering when TRIGBURST = 0.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CLRTRIG</name>
					<description>Clear Trigger.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_CLEARED</name>
							<description>Not cleared. The trigger is not cleared when this descriptor is exhausted. If there is a reload, the next descriptor will be started.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLEARED</name>
							<description>Cleared. The trigger is cleared when this descriptor is exhausted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SETINTA</name>
					<description>Set Interrupt flag A for this channel. There is no hardware distinction between interrupt A and B. They can be used by software to assist with more complex descriptor usage. By convention, interrupt A may be used when only one interrupt flag is needed.</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_EFFECT</name>
							<description>No effect.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET</name>
							<description>Set. The INTA flag for this channel will be set when the current descriptor is exhausted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SETINTB</name>
					<description>Set Interrupt flag B for this channel. There is no hardware distinction between interrupt A and B. They can be used by software to assist with more complex descriptor usage. By convention, interrupt A may be used when only one interrupt flag is needed.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_EFFECT</name>
							<description>No effect.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET</name>
							<description>Set. The INTB flag for this channel will be set when the current descriptor is exhausted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[7:6]</bitRange>

