cmsis-svd/cmsis-svd/data/NXP/LPC11U6x.svd
	</registers>
</peripheral>
		<peripheral>
	<name>PINT</name>
	<description> Pin interrupt
and pattern match (PINT) </description>
	<groupName>PINT</groupName>
	<baseAddress>0xA0004000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>PIN_INT0</name>
	<value>0</value>
	</interrupt>
	<interrupt>
	<name>PIN_INT1</name>
	<value>1</value>
	</interrupt>
	<interrupt>
	<name>PIN_INT2</name>
	<value>2</value>
	</interrupt>
	<interrupt>
	<name>PIN_INT3</name>
	<value>3</value>
	</interrupt>
	<interrupt>
	<name>PIN_INT4</name>
	<value>4</value>
	</interrupt>
	<interrupt>
	<name>PIN_INT5</name>
	<value>5</value>
	</interrupt>
	<interrupt>
	<name>PIN_INT6</name>
	<value>6</value>
	</interrupt>
	<interrupt>
	<name>PIN_INT7</name>
	<value>7</value>
	</interrupt>
	<registers>
		<register>
			<name>ISEL</name>
			<description>Pin Interrupt Mode register</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PMODE0</name>
					<description>Selects the interrupt mode for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Edge sensitive 1 = Level sensitive</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>PMODE1</name>
					<description>Selects the interrupt mode for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Edge sensitive 1 = Level sensitive</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>PMODE2</name>
					<description>Selects the interrupt mode for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Edge sensitive 1 = Level sensitive</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>PMODE3</name>
					<description>Selects the interrupt mode for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Edge sensitive 1 = Level sensitive</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>PMODE4</name>
					<description>Selects the interrupt mode for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Edge sensitive 1 = Level sensitive</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>PMODE5</name>
					<description>Selects the interrupt mode for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Edge sensitive 1 = Level sensitive</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>PMODE6</name>
					<description>Selects the interrupt mode for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Edge sensitive 1 = Level sensitive</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>PMODE7</name>
					<description>Selects the interrupt mode for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Edge sensitive 1 = Level sensitive</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>IENR</name>
			<description>Pin interrupt level or rising edge  interrupt enable register</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ENRL0</name>
					<description>Enables the rising edge or level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable rising edge or level interrupt. 1 = Enable rising edge or level interrupt.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>ENRL1</name>
					<description>Enables the rising edge or level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable rising edge or level interrupt. 1 = Enable rising edge or level interrupt.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>ENRL2</name>
					<description>Enables the rising edge or level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable rising edge or level interrupt. 1 = Enable rising edge or level interrupt.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>ENRL3</name>
					<description>Enables the rising edge or level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable rising edge or level interrupt. 1 = Enable rising edge or level interrupt.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>ENRL4</name>
					<description>Enables the rising edge or level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable rising edge or level interrupt. 1 = Enable rising edge or level interrupt.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>ENRL5</name>
					<description>Enables the rising edge or level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable rising edge or level interrupt. 1 = Enable rising edge or level interrupt.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>ENRL6</name>
					<description>Enables the rising edge or level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable rising edge or level interrupt. 1 = Enable rising edge or level interrupt.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>ENRL7</name>
					<description>Enables the rising edge or level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable rising edge or level interrupt. 1 = Enable rising edge or level interrupt.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SIENR</name>
			<description>Pin interrupt level or rising edge  interrupt set register</description>
			<addressOffset>0x008</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>SETENRL0</name>
					<description>Ones written to this address set bits in the IENR, thus enabling interrupts. Bit n sets bit n in the IENR register. 0 = No operation. 1 = Enable rising edge or level interrupt.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>SETENRL1</name>
					<description>Ones written to this address set bits in the IENR, thus enabling interrupts. Bit n sets bit n in the IENR register. 0 = No operation. 1 = Enable rising edge or level interrupt.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>SETENRL2</name>
					<description>Ones written to this address set bits in the IENR, thus enabling interrupts. Bit n sets bit n in the IENR register. 0 = No operation. 1 = Enable rising edge or level interrupt.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>SETENRL3</name>
					<description>Ones written to this address set bits in the IENR, thus enabling interrupts. Bit n sets bit n in the IENR register. 0 = No operation. 1 = Enable rising edge or level interrupt.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>SETENRL4</name>
					<description>Ones written to this address set bits in the IENR, thus enabling interrupts. Bit n sets bit n in the IENR register. 0 = No operation. 1 = Enable rising edge or level interrupt.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>SETENRL5</name>
					<description>Ones written to this address set bits in the IENR, thus enabling interrupts. Bit n sets bit n in the IENR register. 0 = No operation. 1 = Enable rising edge or level interrupt.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>SETENRL6</name>
					<description>Ones written to this address set bits in the IENR, thus enabling interrupts. Bit n sets bit n in the IENR register. 0 = No operation. 1 = Enable rising edge or level interrupt.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>SETENRL7</name>
					<description>Ones written to this address set bits in the IENR, thus enabling interrupts. Bit n sets bit n in the IENR register. 0 = No operation. 1 = Enable rising edge or level interrupt.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CIENR</name>
			<description>Pin interrupt level (rising edge interrupt) clear register</description>
			<addressOffset>0x00C</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>CENRL0</name>
					<description>Ones written to this address clear bits in the IENR, thus disabling the interrupts. Bit n clears bit n in the IENR register. 0 = No operation. 1 = Disable rising edge or level interrupt.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>CENRL1</name>
					<description>Ones written to this address clear bits in the IENR, thus disabling the interrupts. Bit n clears bit n in the IENR register. 0 = No operation. 1 = Disable rising edge or level interrupt.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>CENRL2</name>
					<description>Ones written to this address clear bits in the IENR, thus disabling the interrupts. Bit n clears bit n in the IENR register. 0 = No operation. 1 = Disable rising edge or level interrupt.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>CENRL3</name>
					<description>Ones written to this address clear bits in the IENR, thus disabling the interrupts. Bit n clears bit n in the IENR register. 0 = No operation. 1 = Disable rising edge or level interrupt.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CENRL4</name>
					<description>Ones written to this address clear bits in the IENR, thus disabling the interrupts. Bit n clears bit n in the IENR register. 0 = No operation. 1 = Disable rising edge or level interrupt.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>CENRL5</name>
					<description>Ones written to this address clear bits in the IENR, thus disabling the interrupts. Bit n clears bit n in the IENR register. 0 = No operation. 1 = Disable rising edge or level interrupt.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>CENRL6</name>
					<description>Ones written to this address clear bits in the IENR, thus disabling the interrupts. Bit n clears bit n in the IENR register. 0 = No operation. 1 = Disable rising edge or level interrupt.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>CENRL7</name>
					<description>Ones written to this address clear bits in the IENR, thus disabling the interrupts. Bit n clears bit n in the IENR register. 0 = No operation. 1 = Disable rising edge or level interrupt.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>IENF</name>
			<description>Pin interrupt active level or falling edge  interrupt enable register</description>
			<addressOffset>0x010</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ENAF0</name>
					<description>Enables the falling edge or configures the active level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable falling edge interrupt or set active interrupt level LOW. 1 = Enable falling edge interrupt enabled or set active interrupt level HIGH.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>ENAF1</name>
					<description>Enables the falling edge or configures the active level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable falling edge interrupt or set active interrupt level LOW. 1 = Enable falling edge interrupt enabled or set active interrupt level HIGH.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>ENAF2</name>
					<description>Enables the falling edge or configures the active level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable falling edge interrupt or set active interrupt level LOW. 1 = Enable falling edge interrupt enabled or set active interrupt level HIGH.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>ENAF3</name>
					<description>Enables the falling edge or configures the active level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable falling edge interrupt or set active interrupt level LOW. 1 = Enable falling edge interrupt enabled or set active interrupt level HIGH.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>ENAF4</name>
					<description>Enables the falling edge or configures the active level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable falling edge interrupt or set active interrupt level LOW. 1 = Enable falling edge interrupt enabled or set active interrupt level HIGH.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>ENAF5</name>
					<description>Enables the falling edge or configures the active level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable falling edge interrupt or set active interrupt level LOW. 1 = Enable falling edge interrupt enabled or set active interrupt level HIGH.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>ENAF6</name>
					<description>Enables the falling edge or configures the active level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable falling edge interrupt or set active interrupt level LOW. 1 = Enable falling edge interrupt enabled or set active interrupt level HIGH.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>ENAF7</name>
					<description>Enables the falling edge or configures the active level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable falling edge interrupt or set active interrupt level LOW. 1 = Enable falling edge interrupt enabled or set active interrupt level HIGH.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SIENF</name>
			<description>Pin interrupt active level or falling edge  interrupt set register</description>
			<addressOffset>0x014</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>SETENAF0</name>
					<description>Ones written to this address set bits in the IENF, thus enabling interrupts. Bit n sets bit n in the IENF register. 0 = No operation. 1 = Select HIGH-active interrupt or enable falling edge interrupt.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>SETENAF1</name>
					<description>Ones written to this address set bits in the IENF, thus enabling interrupts. Bit n sets bit n in the IENF register. 0 = No operation. 1 = Select HIGH-active interrupt or enable falling edge interrupt.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>SETENAF2</name>
					<description>Ones written to this address set bits in the IENF, thus enabling interrupts. Bit n sets bit n in the IENF register. 0 = No operation. 1 = Select HIGH-active interrupt or enable falling edge interrupt.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>SETENAF3</name>
					<description>Ones written to this address set bits in the IENF, thus enabling interrupts. Bit n sets bit n in the IENF register. 0 = No operation. 1 = Select HIGH-active interrupt or enable falling edge interrupt.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>SETENAF4</name>
					<description>Ones written to this address set bits in the IENF, thus enabling interrupts. Bit n sets bit n in the IENF register. 0 = No operation. 1 = Select HIGH-active interrupt or enable falling edge interrupt.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>SETENAF5</name>
					<description>Ones written to this address set bits in the IENF, thus enabling interrupts. Bit n sets bit n in the IENF register. 0 = No operation. 1 = Select HIGH-active interrupt or enable falling edge interrupt.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>SETENAF6</name>
					<description>Ones written to this address set bits in the IENF, thus enabling interrupts. Bit n sets bit n in the IENF register. 0 = No operation. 1 = Select HIGH-active interrupt or enable falling edge interrupt.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>SETENAF7</name>
					<description>Ones written to this address set bits in the IENF, thus enabling interrupts. Bit n sets bit n in the IENF register. 0 = No operation. 1 = Select HIGH-active interrupt or enable falling edge interrupt.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CIENF</name>
			<description>Pin interrupt active level or falling edge  interrupt clear register</description>
			<addressOffset>0x018</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>CENAF0</name>
					<description>Ones written to this address clears bits in the IENF, thus disabling interrupts. Bit n clears bit n in the IENF register. 0 = No operation. 1 = LOW-active interrupt selected or falling edge interrupt disabled.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>CENAF1</name>
					<description>Ones written to this address clears bits in the IENF, thus disabling interrupts. Bit n clears bit n in the IENF register. 0 = No operation. 1 = LOW-active interrupt selected or falling edge interrupt disabled.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>CENAF2</name>
					<description>Ones written to this address clears bits in the IENF, thus disabling interrupts. Bit n clears bit n in the IENF register. 0 = No operation. 1 = LOW-active interrupt selected or falling edge interrupt disabled.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>CENAF3</name>
					<description>Ones written to this address clears bits in the IENF, thus disabling interrupts. Bit n clears bit n in the IENF register. 0 = No operation. 1 = LOW-active interrupt selected or falling edge interrupt disabled.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CENAF4</name>
					<description>Ones written to this address clears bits in the IENF, thus disabling interrupts. Bit n clears bit n in the IENF register. 0 = No operation. 1 = LOW-active interrupt selected or falling edge interrupt disabled.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>CENAF5</name>
					<description>Ones written to this address clears bits in the IENF, thus disabling interrupts. Bit n clears bit n in the IENF register. 0 = No operation. 1 = LOW-active interrupt selected or falling edge interrupt disabled.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>CENAF6</name>
					<description>Ones written to this address clears bits in the IENF, thus disabling interrupts. Bit n clears bit n in the IENF register. 0 = No operation. 1 = LOW-active interrupt selected or falling edge interrupt disabled.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>CENAF7</name>
					<description>Ones written to this address clears bits in the IENF, thus disabling interrupts. Bit n clears bit n in the IENF register. 0 = No operation. 1 = LOW-active interrupt selected or falling edge interrupt disabled.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
